InformationRegisters/абс_СтатусыЗаказовПокупателя/абс_СтатусыЗаказовПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СтатусыЗаказовПокупателя</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыОтгрузки</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/абс_СтатусыОтгрузки/абс_СтатусыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыОтгрузки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подобран</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаСборка</name>
  </enumValues>
</mdclass:Enum>

CommonModules/абс_СтатусыОтгрузок/Module.bsl
Процедура ИзменитьСтатусОбъекта(Ссылка, Статус) Экспорт
	Объект = Ссылка.ПолучитьОбъект();
	
	// << Горбунов, если возвращается статус заявки на транспорт, то ставим в заказе покупателя статус "Отгружен".
	Если Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен И ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Если Не Объект.абс_Статус = Статус Тогда
			Объект.ЗаписатьНовыйСтатус(Статус);
		КонецЕсли;
	ИначеЕсли (Статус = Перечисления.абс_СтатусыОтгрузки.Доставлен Или Статус = Перечисления.абс_СтатусыОтгрузки.Закрыт) И ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Если Не Объект.абс_Статус = Статус Тогда
			Статус = Перечисления.абс_СтатусыОтгрузки.Доставлен;
			Объект.ЗаписатьНовыйСтатус(Статус);
		КонецЕсли;
	ИначеЕсли Статус = Перечисления.абс_СтатусыОтгрузки.ВПути И ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Если Не Объект.абс_Статус = Статус Тогда
			Статус = Перечисления.абс_СтатусыОтгрузки.ВПути;
			Объект.ЗаписатьНовыйСтатус(Статус);
		КонецЕсли;
	КонецЕсли;
	// >> Горбунов
	
	Если Объект.Метаданные().Реквизиты.Найти("Статус")<>Неопределено Тогда
		Объект.Статус = Статус;
	ИначеЕсли Объект.Метаданные().Реквизиты.Найти("абс_Статус")<>Неопределено Тогда
		Объект.абс_Статус = Статус;
	КонецЕсли;
	
	Если Найти(ТипЗнч(Объект), "Документ")>0 Тогда
		//+Лео Сафонов ЕА   Проблема:При проведении из обменов ошибка при "Объект.ОбменДанными.Загрузка = Истина" При проведении из транспорта пробелема без этой строки
		//Объект.ОбменДанными.Загрузка = Истина;
		//Объект.Записать(РежимЗаписиДокумента.Проведение);
		//Попытка
		//	Объект.ОбменДанными.Загрузка = Истина;
		Если Объект.Проведен Тогда
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Объект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		//Исключение
		//	Объект.Записать(РежимЗаписиДокумента.Проведение);
		//КонецПопытки;
		//-Лео Сафонов ЕА

	Иначе 
		Объект.Записать();
	КонецЕсли;
	
КонецПроцедуры

//АБС ВСТАВКА 39056  18.02.2014 13:03:40  Шамов
Функция ПолучитьСтатусЗаказаПоРегистру(ЗаказПокупателяСсылка) Экспорт 
	
	ЗапросСтатус = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	абс_СтатусыЗаказовПокупателяСрезПоследних.Статус КАК Статус,
	|	абс_СтатусыЗаказовПокупателяСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.абс_СтатусыЗаказовПокупателя.СрезПоследних(&Период, ЗаказПокупателя = &ЗаказПокупателяСсылка) КАК абс_СтатусыЗаказовПокупателяСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	ЗапросСтатус.УстановитьПараметр("Период"				, Новый Граница(абс_СерверныеФункции.ПолучитьДатуСервера(), ВидГраницы.Включая));
	ЗапросСтатус.УстановитьПараметр("ЗаказПокупателяСсылка"	, ЗаказПокупателяСсылка);
	
	ВыборкаСтатус = ЗапросСтатус.Выполнить().Выбрать();
	
	ТекСтатус = Неопределено;
	Если ВыборкаСтатус.Следующий() Тогда
		ТекСтатус = ВыборкаСтатус.Статус;
	КонецЕсли;
	
	Возврат ТекСтатус;
	
КонецФункции
//АБС ВСТАВКА 39056 КОНЕЦ
